offgrid88/project-dryad/esp32_lcd_project/sdkconfig.defaults
# ESP32-C3 Circular LCD Project Configuration

# Target chip
CONFIG_IDF_TARGET="esp32c3"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition Table
CONFIG_PARTITION_TABLE_SINGLE_APP=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp.csv"

# ESP32C3-specific
CONFIG_ESP32C3_DEFAULT_CPU_FREQ_160=y
CONFIG_ESP32C3_DEFAULT_CPU_FREQ_MHZ=160

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# LCD Configuration
CONFIG_LCD_PANEL_IO_FORMAT_BUF_SIZE=4096

# SPI Configuration
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
CONFIG_SPI_MASTER_IN_IRAM=y

# ESP Timer
CONFIG_ESP_TIMER_PROFILING=n

# Heap
CONFIG_HEAP_POISONING_LIGHT=y

# Stack Smashing Protection
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y

# Watchdog
CONFIG_ESP_TASK_WDT_PANIC=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# GPIO
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# Sleep
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=n

# Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y